Revit 2026 API

# FamilyInstancePlacingArgsStatusMessage Property

---

The message to be shown on the status bar

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string StatusMessage { get; set; }
```
```vb
Public Property StatusMessage As String
	Get
	Set
```
```cpp
public:
property String^ StatusMessage {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member StatusMessage : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

FamilyInstancePlacingArgs Class

Autodesk.Revit.UI Namespace